Template/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Uinlet          (U_x 0	U_z);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $Uinlet;

boundaryField
{

    wing
    {
        type            noSlip;
    }
    

    inlet
    {
        type            freestreamVelocity;
        freestreamValue uniform $Uinlet;
    }
    
    outlet
    {
        type            freestreamVelocity;
        freestreamValue uniform $Uinlet;
    }
    
    symm
    {
        type            symmetryPlane;
    }
    Back
    {
        type            freestreamVelocity;
        freestreamValue uniform $Uinlet;
    }
    topAndBottom
    {
        type            freestreamVelocity;
        freestreamValue uniform $Uinlet;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
