Template/0.orig/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField  uniform  1.0e-05;

boundaryField
{
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 1.0e-05;
        value           uniform 1.0e-05;
    }
    
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1.0e-05;
        value           uniform 1.0e-05;
    }
    
    symm
    {
        type            symmetryPlane;
    }
    Back
    {
        type            inletOutlet;
        inletValue      uniform 1.0e-05;
        value           uniform 1.0e-05;
    }
    topAndBottom
    {
        type            inletOutlet;
        inletValue      uniform 1.0e-05;
        value           uniform 1.0e-05;
    }
    wing
    {
        type            fixedValue;
        value           uniform 0;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
