Template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-18. 0 -18)
    ( 18  0 -18)
    ( 18  18 -18)
    (-18. 18 -18)
    (-18. 0  18)
    ( 18  0  18)
    ( 18  18  18)
    (-18. 18  18)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 15 30) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    symFront
    {
        type symmetryPlane;
        faces
        (
            (1 5 4 0)
        );
    }
    
        symBack
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    topAndBottom
    {
        type patch;
        faces
        (
            (4 5 6 7)
            (0 3 2 1)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
